// -----------------------------------------------------------------------------
// فایل: 02_call_by_reference.cpp
//
// هدف آموزشی:
// - درک Call by Reference (ارسال با ارجاع)
// - مشاهده اینکه تغییر در پارامتر تابع، مستقیماً متغیر اصلی را تغییر می‌دهد
// -----------------------------------------------------------------------------

#include <iostream>
using namespace std;

void f(int &x)
{
    x = 10;
}

int main()
{
    int a = 0;

    f(a);
    
    cout << a << endl; // خروجی: 10

    return 0;
}
