// -----------------------------------------------------------------------------
// مثال: قوانین reference
//
// هدف آموزشی:
// - آشنایی با برخی قوانین reference در C++
//
// -----------------------------------------------------------------------------
// مهم‌ترین قانون:
//
// reference باید هنگام تعریف مقداردهی شود.
//
// مثال درست:
//
//      int x = 5;
//      int &y = x;
//
// مثال نادرست:
//
//      int &y;     // خطا
//
// -----------------------------------------------------------------------------

#include <iostream>
using namespace std;

int main()
{
    int x;
    x = 12;

    int &y = x;

    // int &y;     // خطا

    return 0;
}
