// -----------------------------------------------------------------------------
// مثال: قوانین reference
//
// هدف آموزشی:
// - درک قوانین مقداردهی ارجاع (Reference)
//
// -----------------------------------------------------------------------------
// قوانین اصلی:
// 1. ارجاع باید حتماً هنگام تعریف مقداردهی شود (نمی‌تواند خالی بماند).
// 2. ارجاع نمی‌تواند به مقادیر ثابت (Literal) متصل شود.
//
// -----------------------------------------------------------------------------

#include <iostream>
using namespace std;

int main()
{
    // قانون ۱: مقداردهی اولیه هنگام تعریف
    int x = 12;
    int &y = x; // درست است

    // int &z;  // خطا: ارجاع باید حتما به چیزی اشاره کند

    // قانون ۲: عدم اتصال به مقادیر ثابت
    // int &a = 10; // خطا: عدد ۱۰ یک مقدار ثابت است، نه یک متغیر در حافظه

    cout << "x is: " << x << endl;
    cout << "y is: " << y << endl;

    return 0;
}
