#include <iostream> 
using namespace std; 

int main()
{
    // روش 1: چاپ در یک دستور (استفاده از '\n' در میانه رشته)
    cout << "\n 1----------- \n"; // برای جداسازی خروجی ها، یک خط فاصله چاپ می کند.
    cout << "test1\ntest2";       // 'test1' و سپس '\n' (خط جدید) و بعد 'test2' را چاپ می کند.

    // روش 2: چاپ در سه دستور جداگانه
    cout << "\n 2----------- \n";
    cout << "test1"; // ابتدا 'test1' را چاپ می کند.
    cout << "\n";    // سپس کاراکتر خط جدید را در یک دستور جداگانه چاپ می کند.
    cout << "test2"; // در نهایت 'test2' را در خط جدید چاپ می کند.

    // روش 3: کاراکتر خط جدید در انتهای دستور اول
    cout << "\n 3----------- \n";
    cout << "test1\n"; // 'test1' را به همراه '\n' در انتهای آن چاپ می کند (انتقال به خط بعد).
    cout << "test2";   // 'test2' را در خط جدید بعدی چاپ می کند.

    // روش 4: کاراکتر خط جدید در ابتدای دستور دوم
    cout << "\n 4----------- \n";
    cout << "test1";   // فقط 'test1' را چاپ می کند.
    cout << "\ntest2"; // ابتدا '\n' (خط جدید) را چاپ کرده، سپس بلافاصله 'test2' را در آن خط چاپ می کند.

    return 0; // پایان موفقیت آمیز برنامه را اعلام می کند.
}