// -----------------------------------------------------------------------------
// مثال: تفاوت copy و reference
//
// هدف آموزشی:
// - درک تفاوت بین کپی کردن یک متغیر
// - و ساختن یک reference
//
// -----------------------------------------------------------------------------
// اگر یک متغیر را اینگونه تعریف کنیم:
//
//      int y = x;
//
// مقدار x در y کپی می‌شود.
// بنابراین تغییر y روی x تاثیری ندارد.
//
// اما اگر reference بسازیم:
//
//      int &y = x;
//
// در این حالت y فقط نام دیگری برای x است.
//
// -----------------------------------------------------------------------------

#include <iostream>
using namespace std;

int main()
{
    int x;
    x= 12;

    int y = x; // copy

    y = 18;

    cout << x << "\n";
    cout << y << "\n";

    return 0;
}
