// -----------------------------------------------------------------------------
// مثال: قوانین reference
//
// هدف آموزشی:
// - آشنایی با برخی قوانین reference در C++
//
// -----------------------------------------------------------------------------
// مهم‌ترین قانون:
//
// reference باید هنگام تعریف مقداردهی شود.
//
// مثال درست:
//
//      int x = 5;
//      int &r = x;
//
// مثال نادرست:
//
//      int &r;     // خطا
//
// -----------------------------------------------------------------------------

#include <iostream>
using namespace std;

int main()
{
    int x = 5;

    int &r = x;

    cout << r << endl;

    return 0;
}
