// -----------------------------------------------------------------------------
// این فایل برای معرفی و آشنایی اولیه با «آرایه‌ها» در زبان ++C نوشته شده است.
// در این مثال:
// - یک آرایه با اندازه 15 تعریف می‌کنیم.
// - چند مقدار را در خانه‌های مختلف آرایه قرار می‌دهیم.
// - یک مقدار را از کاربر می‌گیریم و در آرایه ذخیره می‌کنیم.
// - سپس از مقادیر داخل آرایه یک محاسبه انجام داده و نتیجه را چاپ می‌کنیم.
//
// هدف این مثال:
// آشنایی دانشجو با نحوه‌ی تعریف آرایه، دسترسی به خانه‌های مختلف آن
// و نحوه‌ی استفاده از مقادیر ذخیره‌شده در آرایه در محاسبات.
// -----------------------------------------------------------------------------

#include <iostream>
using namespace std;

int main()
{
    int a[15];

    a[2] = 13;
    a[0] = 2 * a[2];

    cin >> a[3];

    int x = a[2] + a[0] - 4;

    cout << a[2];

    return 0;
}
